import { createStore } from 'vuex'

export default createStore({
    state: {
        mapList: ['树林之主', '参差林木', '伐木征税', '吝啬陷阱', '林中寻宝', '互惠互利',
            '采石者', '遗智还家', '守卫自然', '取舍', '采矿苦力', '矿脉守卫', '采矿场', '水边矿脉',
            '固守险境', '部落之争', '岩壳蟹群', '灵巧之兽', '圈养', '饮水为饵', '佣兵的所属', '直奔深渊',
            '源石虫害', '战士的视野', '无形界限', '驯化', '苔藓酒', '大迁徙', '丢失的订单', '不尽烈火',
            '被限制的怒火', '诅咒', '战斗技巧', '大酋长的选举', '生计', '征税的选择', '叮当作响', '以卵击石',
            '战争本能', '失落的长生军', '失落的巨翼兽', '大地病征', '风啸峡谷', '砾沙平原', '崎岖窄路']
    },
    mutations: {
    }
})